Revit 2027 API
ComputationDataFor3DPathSet Methods
The ComputationDataFor3DPathSet type exposes the following members.
Methods
Name | Description
CreateFromCurves |  Creates a new instance of the ComputationDataFor3DPathSet class from the provided curves.
CreateFromRebar |  Creates a new instance of the ComputationDataFor3DPathSet class from the provided Rebar element.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurves |  Gets the curves that define the 3D path set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTerminationPlaneNormal |  Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetTerminationPlaneNormal |  Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace